<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 21 changes.</summary>

```diff
! module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
- module.coreos_image.proxmox_virtual_environment_download_file.images["coreos_img"] will be destroyed
# (because proxmox_virtual_environment_download_file.images is not in configuration)
- module.coreos_image.random_id.image_id["coreos_img"] will be destroyed
# (because random_id.image_id is not in configuration)
- module.debian_bookworm_image.proxmox_virtual_environment_download_file.images["debian_bookworm"] will be destroyed
# (because proxmox_virtual_environment_download_file.images is not in configuration)
- module.debian_bookworm_image.random_id.image_id["debian_bookworm"] will be destroyed
# (because random_id.image_id is not in configuration)
- module.debian_trixie_image.proxmox_virtual_environment_download_file.images["debian_trixie"] will be destroyed
# (because proxmox_virtual_environment_download_file.images is not in configuration)
- module.debian_trixie_image.random_id.image_id["debian_trixie"] will be destroyed
# (because random_id.image_id is not in configuration)
+ module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"] will be created
+ module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_bookworm"] will be created
+ module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_trixie"] will be created
+ module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] will be created
+ module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] will be created
+ module.proxmox_images.random_id.image_id["coreos_img"] will be created
+ module.proxmox_images.random_id.image_id["debian_bookworm"] will be created
+ module.proxmox_images.random_id.image_id["debian_trixie"] will be created
+ module.proxmox_images.random_id.image_id["ubuntu_jammy"] will be created
+ module.proxmox_images.random_id.image_id["ubuntu_noble_cloud_image"] will be created
- module.ubuntu_jammy_image.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] will be destroyed
# (because proxmox_virtual_environment_download_file.images is not in configuration)
- module.ubuntu_jammy_image.random_id.image_id["ubuntu_jammy"] will be destroyed
# (because random_id.image_id is not in configuration)
- module.ubuntu_noble_cloud_image.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] will be destroyed
# (because proxmox_virtual_environment_download_file.images is not in configuration)
- module.ubuntu_noble_cloud_image.random_id.image_id["ubuntu_noble_cloud_image"] will be destroyed
# (because random_id.image_id is not in configuration)
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 11 to add, 0 to change, 11 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-13T19:14:23Z [(view log)](https://github.com/perchnet/p/actions/runs/16252560092/job/45884220240#step:9:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.1.231",
            ],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "2600:4808:6170:3a00::a377",
              - "fdfd:3a:a7ff:0:c5c1:b2a6:461b:9de6",
              - "2600:4808:6170:3a00:c3c1:642a:9a71:f1ea",
              - "fe80::5a14:8a9f:91c:25e5",
            ],
          - [
              - "fe80::f4a6:340e:220e:9ca",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:AF:D8:63",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                    = "coreos-periphery-test"
      ~ network_interface_names = [
          - "lo",
          - "ens18",
          - "tailscale0",
        ] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ file_id           = "zssd-files:iso/fedora-coreos-42_8787_.20250705.2.0-proxmoxve.x86_64.qcow2.xz.img" -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:AF:D8:63" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.coreos_image.proxmox_virtual_environment_download_file.images["coreos_img"] will be destroyed
  # (because proxmox_virtual_environment_download_file.images is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "images" {
      - checksum                = "7fb66f45fd80e2bb33c5d1c1899fdce47b00c2abc9159f6c03f60a7ebd9c18a1" -> null
      - checksum_algorithm      = "sha256" -> null
      - content_type            = "iso" -> null
      - datastore_id            = "zssd-files" -> null
      - decompression_algorithm = "zst" -> null
      - file_name               = "fedora-coreos-42_8787_.20250705.2.0-proxmoxve.x86_64.qcow2.xz.img" -> null
      - id                      = "zssd-files:iso/fedora-coreos-42_8787_.20250705.2.0-proxmoxve.x86_64.qcow2.xz.img" -> null
      - node_name               = "pve1" -> null
      - overwrite               = true -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 1981022208 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250705.2.0/x86_64/fedora-coreos-42.20250705.2.0-proxmoxve.x86_64.qcow2.xz" -> null
      - verify                  = true -> null
    }

  # module.coreos_image.random_id.image_id["coreos_img"] will be destroyed
  # (because random_id.image_id is not in configuration)
  - resource "random_id" "image_id" {
      - b64_std     = "h4c=" -> null
      - b64_url     = "h4c" -> null
      - byte_length = 2 -> null
      - dec         = "34695" -> null
      - hex         = "8787" -> null
      - id          = "h4c" -> null
      - keepers     = {
          - "url" = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250705.2.0/x86_64/fedora-coreos-42.20250705.2.0-proxmoxve.x86_64.qcow2.xz"
        } -> null
    }

  # module.debian_bookworm_image.proxmox_virtual_environment_download_file.images["debian_bookworm"] will be destroyed
  # (because proxmox_virtual_environment_download_file.images is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "images" {
      - checksum            = "38557e6d8e8738392dc5959b679c4567dbe4ce6475aaa3ba054caab4f1e4f90876c49f6e20be79a5a151105e121f2e19a51319bdb0a223c90fea11b0a13deb25" -> null
      - checksum_algorithm  = "sha512" -> null
      - content_type        = "iso" -> null
      - datastore_id        = "zssd-files" -> null
      - file_name           = "debian-12-nocloud-amd64_f5e6_.qcow2.img" -> null
      - id                  = "zssd-files:iso/debian-12-nocloud-amd64_f5e6_.qcow2.img" -> null
      - node_name           = "pve1" -> null
      - overwrite           = true -> null
      - overwrite_unmanaged = false -> null
      - size                = 419627008 -> null
      - upload_timeout      = 600 -> null
      - url                 = "https://cloud.debian.org/images/cloud/bookworm/20250428-2096/debian-12-nocloud-amd64-20250428-2096.qcow2" -> null
      - verify              = true -> null
    }

  # module.debian_bookworm_image.random_id.image_id["debian_bookworm"] will be destroyed
  # (because random_id.image_id is not in configuration)
  - resource "random_id" "image_id" {
      - b64_std     = "9eY=" -> null
      - b64_url     = "9eY" -> null
      - byte_length = 2 -> null
      - dec         = "62950" -> null
      - hex         = "f5e6" -> null
      - id          = "9eY" -> null
      - keepers     = {
          - "url" = "https://cloud.debian.org/images/cloud/bookworm/20250428-2096/debian-12-nocloud-amd64-20250428-2096.qcow2"
        } -> null
    }

  # module.debian_trixie_image.proxmox_virtual_environment_download_file.images["debian_trixie"] will be destroyed
  # (because proxmox_virtual_environment_download_file.images is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "images" {
      - checksum            = "046d9691b1a6026fd457b85c85476fa721249dd9379e23ab877bb34b2d6fa662994b03a23ffe7b527c5421cb1a69e81b6873c82f0e1ac9403bbaad263fffd3d8" -> null
      - checksum_algorithm  = "sha512" -> null
      - content_type        = "iso" -> null
      - datastore_id        = "zssd-files" -> null
      - file_name           = "debian-13-genericcloud-amd64_1354_.qcow2.img" -> null
      - id                  = "zssd-files:iso/debian-13-genericcloud-amd64_1354_.qcow2.img" -> null
      - node_name           = "pve1" -> null
      - overwrite           = true -> null
      - overwrite_unmanaged = false -> null
      - size                = 434110464 -> null
      - upload_timeout      = 600 -> null
      - url                 = "https://cloud.debian.org/images/cloud/trixie/daily/20250619-2148/debian-13-generic-amd64-daily-20250619-2148.qcow2" -> null
      - verify              = true -> null
    }

  # module.debian_trixie_image.random_id.image_id["debian_trixie"] will be destroyed
  # (because random_id.image_id is not in configuration)
  - resource "random_id" "image_id" {
      - b64_std     = "E1Q=" -> null
      - b64_url     = "E1Q" -> null
      - byte_length = 2 -> null
      - dec         = "4948" -> null
      - hex         = "1354" -> null
      - id          = "E1Q" -> null
      - keepers     = {
          - "url" = "https://cloud.debian.org/images/cloud/trixie/daily/20250619-2148/debian-13-generic-amd64-daily-20250619-2148.qcow2"
        } -> null
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum                = "7fb66f45fd80e2bb33c5d1c1899fdce47b00c2abc9159f6c03f60a7ebd9c18a1"
      + checksum_algorithm      = "sha256"
      + content_type            = "iso"
      + datastore_id            = "zssd-files"
      + decompression_algorithm = "zst"
      + file_name               = (known after apply)
      + id                      = (known after apply)
      + node_name               = "pve1"
      + overwrite               = true
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250705.2.0/x86_64/fedora-coreos-42.20250705.2.0-proxmoxve.x86_64.qcow2.xz"
      + verify                  = true
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_bookworm"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum            = "38557e6d8e8738392dc5959b679c4567dbe4ce6475aaa3ba054caab4f1e4f90876c49f6e20be79a5a151105e121f2e19a51319bdb0a223c90fea11b0a13deb25"
      + checksum_algorithm  = "sha512"
      + content_type        = "iso"
      + datastore_id        = "zssd-files"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud.debian.org/images/cloud/bookworm/20250428-2096/debian-12-nocloud-amd64-20250428-2096.qcow2"
      + verify              = true
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_trixie"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum            = "046d9691b1a6026fd457b85c85476fa721249dd9379e23ab877bb34b2d6fa662994b03a23ffe7b527c5421cb1a69e81b6873c82f0e1ac9403bbaad263fffd3d8"
      + checksum_algorithm  = "sha512"
      + content_type        = "iso"
      + datastore_id        = "zssd-files"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud.debian.org/images/cloud/trixie/daily/20250619-2148/debian-13-generic-amd64-daily-20250619-2148.qcow2"
      + verify              = true
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + content_type        = "iso"
      + datastore_id        = "zssd-files"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
      + verify              = true
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum            = "92d2c4591af9a82785464bede56022c49d4be27bde1bdcf4a9fccc62425cda43"
      + checksum_algorithm  = "sha256"
      + content_type        = "iso"
      + datastore_id        = "zssd-files"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/noble/20250610/noble-server-cloudimg-amd64.img"
      + verify              = true
    }

  # module.proxmox_images.random_id.image_id["coreos_img"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250705.2.0/x86_64/fedora-coreos-42.20250705.2.0-proxmoxve.x86_64.qcow2.xz"
        }
    }

  # module.proxmox_images.random_id.image_id["debian_bookworm"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud.debian.org/images/cloud/bookworm/20250428-2096/debian-12-nocloud-amd64-20250428-2096.qcow2"
        }
    }

  # module.proxmox_images.random_id.image_id["debian_trixie"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud.debian.org/images/cloud/trixie/daily/20250619-2148/debian-13-generic-amd64-daily-20250619-2148.qcow2"
        }
    }

  # module.proxmox_images.random_id.image_id["ubuntu_jammy"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
        }
    }

  # module.proxmox_images.random_id.image_id["ubuntu_noble_cloud_image"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud-images.ubuntu.com/noble/20250610/noble-server-cloudimg-amd64.img"
        }
    }

  # module.ubuntu_jammy_image.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] will be destroyed
  # (because proxmox_virtual_environment_download_file.images is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "images" {
      - content_type        = "iso" -> null
      - datastore_id        = "zssd-files" -> null
      - file_name           = "ubuntu-22_53f9_.04-server-cloudimg-amd64.img" -> null
      - id                  = "zssd-files:iso/ubuntu-22_53f9_.04-server-cloudimg-amd64.img" -> null
      - node_name           = "pve1" -> null
      - overwrite           = true -> null
      - overwrite_unmanaged = false -> null
      - size                = 678153216 -> null
      - upload_timeout      = 600 -> null
      - url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img" -> null
      - verify              = true -> null
    }

  # module.ubuntu_jammy_image.random_id.image_id["ubuntu_jammy"] will be destroyed
  # (because random_id.image_id is not in configuration)
  - resource "random_id" "image_id" {
      - b64_std     = "U/k=" -> null
      - b64_url     = "U_k" -> null
      - byte_length = 2 -> null
      - dec         = "21497" -> null
      - hex         = "53f9" -> null
      - id          = "U_k" -> null
      - keepers     = {
          - "url" = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
        } -> null
    }

  # module.ubuntu_noble_cloud_image.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] will be destroyed
  # (because proxmox_virtual_environment_download_file.images is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "images" {
      - checksum            = "92d2c4591af9a82785464bede56022c49d4be27bde1bdcf4a9fccc62425cda43" -> null
      - checksum_algorithm  = "sha256" -> null
      - content_type        = "iso" -> null
      - datastore_id        = "zssd-files" -> null
      - file_name           = "ubuntu-24_5fc9_.04-cloudimg-amd64.qcow.iso" -> null
      - id                  = "zssd-files:iso/ubuntu-24_5fc9_.04-cloudimg-amd64.qcow.iso" -> null
      - node_name           = "pve1" -> null
      - overwrite           = true -> null
      - overwrite_unmanaged = false -> null
      - size                = 613725184 -> null
      - upload_timeout      = 600 -> null
      - url                 = "https://cloud-images.ubuntu.com/noble/20250610/noble-server-cloudimg-amd64.img" -> null
      - verify              = true -> null
    }

  # module.ubuntu_noble_cloud_image.random_id.image_id["ubuntu_noble_cloud_image"] will be destroyed
  # (because random_id.image_id is not in configuration)
  - resource "random_id" "image_id" {
      - b64_std     = "X8k=" -> null
      - b64_url     = "X8k" -> null
      - byte_length = 2 -> null
      - dec         = "24521" -> null
      - hex         = "5fc9" -> null
      - id          = "X8k" -> null
      - keepers     = {
          - "url" = "https://cloud-images.ubuntu.com/noble/20250610/noble-server-cloudimg-amd64.img"
        } -> null
    }

Plan: 11 to add, 0 to change, 11 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-33-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->